app/views/tasks/edit.html.erb

SELECT "users".* FROM "users"
---
<%= f.text_field :description %>
<%= f.collection_select(:user_id, User.all, :id, :username)%>