app/views/tasks/index.html.erb

<ul>
  <% if @logged_in_user.tasks.empty? %>
---
SELECT  1 AS one FROM "tasks" WHERE "tasks"."user_id" = $1 LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 5]]

    <% else %>
    <% @logged_in_user.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 5]]