app/views/projects/show.html.erb

SELECT  1 AS one FROM "tasks" WHERE "tasks"."project_id" = $1 LIMIT $2  [["project_id", 9], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 3]]
---
<ul>
<% if @project.tasks.empty? %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 9]]
---
  <% else %>
    <% @project.tasks.each do |task| %>