app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def setup

      @logged_in = !!session[:user_id] #!= nil
      if @logged_in
        @logged_in_user_id = session[:user_id]
        @logged_in_user = User.find(@logged_in_user_id)