app/controllers/projects_controller.rb

    def show
      if @logged_in_user.id == Project.find(params[:id]).owner_id
        @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def create
        @project = Project.create(project_params)
---
INSERT INTO "projects" ("title", "synopsis", "owner_id", "deadline", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dsadfsdf"], ["synopsis", "asfas"], ["owner_id", 5], ["deadline", "2019-05-08"], ["created_at", "2019-05-08 19:53:05.499624"], ["updated_at", "2019-05-08 19:53:05.499624"]]