app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "complete", "user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "dsfsdfs"], ["complete", false], ["user_id", 5], ["project_id", 4], ["created_at", "2019-05-10 00:46:22.091136"], ["updated_at", "2019-05-10 00:46:22.091136"]]
---
    def create
        @task = Task.create(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "user_id" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", "Good Job"], ["user_id", 6], ["updated_at", "2019-07-25 17:15:50.505129"], ["id", 21]]
---
    def update
        @task = Task.find(params[:id])
        if @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 13]]
---
    def destroy
        @return_project = Task.find(params[:id])
        Task.destroy(params[:id])